import solyanka from '~/assets/carousel/1.png';
import pies from '~/assets/carousel/2.png';
import pancakes from '~/assets/carousel/3.png';
import health from '~/assets/carousel/4.png';

export const carouselCardData = [
    {
        title: 'Солянка с грибами',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        tag: 'Первые блюда',
        bookmarks: 1,
        image: solyanka,
        categoryId: 'first',
    },
    {
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
        tag: 'Веганские блюда',
        views: 2,
        bookmarks: 1,
        image: pies,
        categoryId: 'vegan',
    },
    {
        title: 'Оладьи на кефире "Пышные"',
        description:
            'Очень вкусные и нежные оладьи на кефире. Настоятельно рекомендую пышные кефирные оладьи на завтрак.',
        tag: 'Десерты, выпечка',
        views: 1,
        image: pancakes,
        categoryId: 'desserts',
    },
    {
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не  салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        tag: 'Салаты',
        image: health,
        categoryId: 'salads',
    },
    {
        title: 'Солянка с грибами',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        tag: 'Первые блюда',
        bookmarks: 1,
        image: solyanka,
        categoryId: 'first',
    },
    {
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
        tag: 'Веганские блюда',
        views: 2,
        bookmarks: 1,
        image: pies,
        categoryId: 'vegan',
    },
    {
        title: 'Оладьи на кефире "Пышные"',
        description:
            'Очень вкусные и нежные оладьи на кефире. Настоятельно рекомендую пышные кефирные оладьи на завтрак.',
        tag: 'Десерты, выпечка',
        views: 1,
        image: pancakes,
        categoryId: 'desserts',
    },
    {
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не  салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        tag: 'Салаты',
        image: health,
        categoryId: 'salads',
    },
    {
        title: 'Солянка с грибами',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        tag: 'Первые блюда',
        bookmarks: 1,
        image: solyanka,
        categoryId: 'first',
    },
    {
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
        tag: 'Веганские блюда',
        views: 2,
        bookmarks: 1,
        image: pies,
        categoryId: 'vegan',
    },
    {
        title: 'Оладьи на кефире "Пышные"',
        description:
            'Очень вкусные и нежные оладьи на кефире. Настоятельно рекомендую пышные кефирные оладьи на завтрак.',
        tag: 'Десерты, выпечка',
        views: 1,
        image: pancakes,
        categoryId: 'desserts',
    },
    {
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не  салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        tag: 'Салаты',
        image: health,
        categoryId: 'salads',
    },
];
